##  POSTTEST 2 KECERDASAN BUATAN

## Patricia Chandra / 2009106030

In [2]:
import pandas as pd

In [6]:
df = pd.read_csv("Top 2000 Universities of the World - Sheet1.csv")

In [7]:
df.head()

,World Rank,Institution,Country,National Rank,Quality of Education Rank,Alumni Employment Rank,Quality of Faculty Rank,Research Performance Rank,Score
0,1,Harvard University,USA,1,1,1,1,1,100.0
1,2,Massachusetts Institute of Technology,USA,2,4,12,2,8,96.7
2,3,Stanford University,USA,3,10,4,3,2,95.1
3,4,University of Cambridge,United Kingdom,1,3,25,4,10,94.1
4,5,University of Oxford,United Kingdom,2,7,27,9,4,93.3

## Jumlah Record, Nama Attribute, Jumlah attribute dengan tipe objek, Jumlah attribute dengan tipe angka, Jumlah attribute yang memiliki nilai null

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   World Rank                 2000 non-null   int64
 1   Institution                2000 non-null   object
 2   Country                    2000 non-null   object
 3   National Rank              2000 non-null   int64
 4   Quality of Education Rank  2000 non-null   object
 5   Alumni Employment Rank     2000 non-null   object
 6   Quality of Faculty Rank    2000 non-null   object
 7   Research Performance Rank  2000 non-null   object
 8   Score                      2000 non-null   float64
dtypes: float64(1), int64(2), object(6)
memory usage: 140.8+ KB

In [10]:
df.isnull().any().sum()

0

## Jumlah Attribute

In [9]:
df.shape

(2000, 9)

## Dictionary dengan key sesuai nama informasinya

In [32]:
dict = {'World Rank' : '1',
        'Institution' : 'Harvard University',
        'Country' : 'USA',
        'National Rank' : '1', 
        'Quality of Education Rank' : '1', 
        'Alumni Employment Rank' : '1', 
        'Quality of Faculty Rank' : '1', 
        'Research Performance Rank' : '1', 
        'Score' : '100.0'}
print ("World Rank : ", dict['World Rank'])
print ("Institution : ", dict['Institution'])
print ("Country : ", dict['Country'])
print ("National Rank : ", dict['National Rank'])
print ("Quality of Education Rank : ", dict['Quality of Education Rank'])
print ("Alumni Employment Rank : ", dict['Alumni Employment Rank'])
print ("Quality of Faculty Rank : ", dict['Quality of Faculty Rank'])
print ("Research Performance Rank : ", dict['Research Performance Rank'])
print ("Score : ", dict['Score'])

World Rank :  1
Institution :  Harvard University
Country :  USA
National Rank :  1
Quality of Education Rank :  1
Alumni Employment Rank :  1
Quality of Faculty Rank :  1
Research Performance Rank :  1
Score :  100.0

## Rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, Q3 dari attribute bertipe angka

In [14]:
df.describe()

         Unnamed: 0        rating
count  12635.000000  12635.000000
mean    6317.319747      6.945105
std     3648.018413      1.254719
min        0.000000      1.000000
25%     3158.500000      6.300000
50%     6317.000000      7.200000
75%     9475.500000      7.800000
max    12637.000000      9.800000

## Data Kolerasi

In [12]:
dfkorel = df.corr()
dfkorel

               World Rank  National Rank     Score
World Rank        1.00000       0.344200 -0.916950
National Rank     0.34420       1.000000 -0.329112
Score            -0.91695      -0.329112  1.000000

## Mengubah salah satu attribute bertipe angka menjadi desimal 3 angka dibelakang koma

In [17]:
df["World Rank"].head()

0    1
1    2
2    3
3    4
4    5
Name: World Rank, dtype: int64

In [20]:
df["World Rank"] = df["World Rank"] * 0.005

In [21]:
df["World Rank"].head()

0    0.000025
1    0.000050
2    0.000075
3    0.000100
4    0.000125
Name: World Rank, dtype: float64

## Tampilkan 10 record pertama dari attribute bertipe angka

In [24]:
df[["World Rank","National Rank","Score"]].head(10)

   World Rank  National Rank  Score
0    0.000025              1  100.0
1    0.000050              2   96.7
2    0.000075              3   95.1
3    0.000100              1   94.1
4    0.000125              2   93.3
5    0.000150              4   92.6
6    0.000175              5   92.0
7    0.000200              6   91.5
8    0.000225              7   91.1
9    0.000250              8   90.7

## Simpan csv

In [33]:
df.to_csv("Posttest_2_2009106030.csv",index=False)